Revit 2027 API
ElementMulticategoryFilter(ICollection<BuiltInCategory>, Boolean) Constructor
 Constructs a new instance of a filter to match elements by built-in category, with the option to match all elements which are not of the given category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementMulticategoryFilter(
	ICollection<BuiltInCategory> categories,
	bool inverted
)
Public Sub New (
	categories As ICollection(Of BuiltInCategory),
	inverted As Boolean
)
public:
ElementMulticategoryFilter(
	ICollection<BuiltInCategory>^ categories,
	bool inverted
)
new :
        categories : ICollection<BuiltInCategory> *
        inverted : bool -> ElementMulticategoryFilter
Parameters
categories ICollection<BuiltInCategory>
 The built-in categories to match.
inverted Boolean
 True if the filter should match all elements which are not of the given built-in categories.
See Also
Reference
ElementMulticategoryFilter Class
ElementMulticategoryFilter Overload
Autodesk.Revit.DB Namespace